src/cfe/КСП/InformationRegisters/ксп_МэппингСкладМагазин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингСкладМагазин</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_МэппингСкладМагазин/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Склад 	- структура (из json) / СправочникСсылка.Склады - 
//
// Возвращаемое значение:
//	Тип: СправочникСсылка.Магазины
//
Функция ПоМэппингу(Склад, ВнешняяСистема) Экспорт

	Перем _Склад;
	
	Если ТипЗнч(Склад) = Тип("Структура") Тогда   // это узел json
		_Склад = ксп_ИмпортСлужебный.НайтиСклад(Склад, ВнешняяСистема);	
	Иначе 
		_Склад = Склад;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_МэппингСкладМагазин.Магазин КАК Магазин
		|ИЗ
		|	РегистрСведений.ксп_МэппингСкладМагазин КАК ксп_МэппингСкладМагазин
		|ГДЕ
		|	ксп_МэппингСкладМагазин.Склад = &Склад
		|	И ксп_МэппингСкладМагазин.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("Склад", _Склад);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Магазин;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
